[
    {
        "name":"Andrew",
        "review":"I am Andrew and I am using Quicken from last 5 Years. Unfortunately there were errors in the software. Quicken Assist was able to identify and correct these errors, allowing us to move forward - confident that our entries were correct."
    },
    {
        "name":"Raymond K. McSherry",
        "review":"Mark with Quicken Assit has been very responsive to our needs and he is a knowledgeable resource for Quicken Software."
    },
    {
        "name":"James S. Adams",
        "review":"Quicken Assist has always been extremely patient and has been able to explain things in an easy to understand manner. I am new to Quicken Premier and the leanring experience has been easy."
    },
    {
        "name":"Theresa L. Christie",
        "review":"Quicken Assist was instrumental in helping me rebuild and simplify our organizational plan through Quicken Deluxe Software. He is a patient professional with an solid understanding of software functionality, accounting and management needs and practical application."
    },
    {
        "name":"Joseph N. Miller",
        "review":"Fez in Quicken Assist team has provided me excellent accounting service for both business and personal needs, for over 5 years."
    },
    {
        "name":"Arnulfo B. Rickman",
        "review":"Quicken Assist is extremely detailed and patient. Teaching an Engineer to do Accounting was probably a challenge. He took the time to learn our business. Fez gets high marks."
    },
    {
        "name":"James S. Adams",
        "review":"Quicken Assist  did an excellent job of training us with Quickbooks. We feel very comfortable using it now."
    },
    {
        "name":"Ione R. White",
        "review":"Quicken Assist is the one to go to for all your accounting planing needs. As new small business owners we weren't sure what we needed to do. Fortunately Mark Sylvester helped us set up our Quickens and showed us how to easily keep up with all our business finances. He continues to be helpful in answering any questions that arise promptly and in clear terms that we can understand and implement. We hope you get a chance to work with Mark and see how he can help your business grow too."
    },
    {
        "name":"Barbara H. Gutierrez",
        "review":"I am using Quicken Deluxe and in starting I didn't know how to use the software? Quicken Assist has helped me to operate the software. Quicken Assist has been a great resource for my growing business today. They have a great knowledge of Quicken and a friendly approach toward teaching. "
    },
    {
        "name":"Terry S. Grant",
        "review":"Easy to work with, gives sound tax and financial planning advice. Would highly recommend Quicken Assist to everyone I know."
    }
]